# YOLOv5 ğŸš€ by Ultralytics, GPL-3.0 license

# Parameters

#107,90, 125,109, 137,113, 133,121, 145,121, 139,128, 148,131, 159,126, 147,140, 157,137, 174,139, 163,150, 210,132, 183,156, 196,177, 229,202

nc: 7  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 4  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   # ØªØ¨Ø¯Ø¡ Ù…Ù† Ø§Ù„ØµÙØ±
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, SpatialGate, [128,3,2]],   #3
   [-2, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, SpatialGate, [64,3,2]], #6  # ATM Ù…Ø¯Ø®Ø®Ù„Ø§Øª Ø§Ù„Ø³Ø¨ÙŠØ´Ù„ Ø¨Ø§Ù„ÙÙ†ÙƒØ´ Ù…Ø§Ù„ØªÙ‡ ÙˆØªÙ… ØªÙ‚Ù„ÙŠÙ„ Ù…Ø±ØªÙŠÙ† ÙˆÙ„Ø°Ù„Ùƒ Ù„Ø§Ù† Ù‚Ø¨Ù„ C3
   [-2, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, SpatialGate, [128,3,2]], #8  #Ading atm
   [-2, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9  
   #[-1, 1, SpatialGate, [256,3,2]],  #13 #Ading atm
  ]

# YOLOv5 v6.0 head
head:
  [  #31
   [[3, 6, 9], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)   Ø§Ø¶Ø§ÙØ© 1 Ø§Ù„Ù‰ ÙƒÙ„ 18 21 24
  ]
