# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters

#107,90, 125,109, 137,113, 133,121, 145,121, 139,128, 148,131, 159,126, 147,140, 157,137, 174,139, 163,150, 210,132, 183,156, 196,177, 229,202

nc: 7  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 4  # AutoAnchor evolves 3 anchors per P output layer

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2   # تبدء من الصفر
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
      #3
   [-2, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
 #6  # ATM مدخخلات السبيشل بالفنكش مالته وتم تقليل مرتين ولذلك لان قبل C3
   [-2, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
  #8  #Ading atm
   [-2, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9  
     #13 #Ading atm
  ]

# YOLOv5 v6.0 head
head:
  [  #31
   [[2, 4, 6,9], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)   اضافة 1 الى كل 18 21 24
  ]
