# YOLOv5 ğŸš€ by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, SpatialGate, [64,3,2]],   # ATM Ù…Ø¯Ø®Ø®Ù„Ø§Øª Ø§Ù„Ø³Ø¨ÙŠØ´Ù„ Ø¨Ø§Ù„ÙÙ†ÙƒØ´ Ù…Ø§Ù„ØªÙ‡ ÙˆØªÙ… ØªÙ‚Ù„ÙŠÙ„ Ù…Ø±ØªÙŠÙ† ÙˆÙ„Ø°Ù„Ùƒ Ù„Ø§Ù† Ù‚Ø¨Ù„ C3
   [-2, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, SpatialGate, [128,3,2]],  #Ading atm
   [-2, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9  
   [-1, 1, SpatialGate, [256,3,2]],  #Ading atm
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4 ## Ø§Ø¶Ø§ÙØ© Ø±Ù‚Ù… Ø¨Ø¯Ù„ Ø§Ù„7 Ø¬Ø§Ù†Øª 6
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3   ØºÙŠØ±Ù†Ø§ Ù„Ù„5
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],  # cat head P4    Ø§Ø¶Ø§ÙØ© Ø±Ù‚Ù… Ø¨Ø¯Ù„ Ø§Ù„15 Ù‚Ø¨Ù„ 14
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 13], 1, Concat, [1]],  # cat head P5  Ø§Ø¶Ø§Ø© Ø±Ù‚Ù… Ù„Ù„11 Ù‚Ø¨Ù„ 10
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[20, 23, 26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)   Ø§Ø¶Ø§ÙØ© 1 Ø§Ù„Ù‰ ÙƒÙ„ 18 21 24
  ]
